/*  plp_esploader.cpp
 *
 *  Copyright (C) 2012 Willem Kemp <http://www.thenocturnaltree.com>
 *  All rights reserved.
 *
 *  This file is part of PortScope.
 *
 *  PortScope is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  PortScope is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with PortScope. If not, see http://www.gnu.org/licenses/.
 *
 */
#include "plp_esploader.h"

#pragma pack(push)
#pragma pack(1)


#define NTOHS(x) (((x & 0xff) << 8) | ((x >> 8) & 0xff))
#define NTOHL(x) (((x & 0xff) << 24) | (((x >> 8) & 0xff) << 16) | (((x >> 16) & 0xff) << 8) | ((x >> 24) & 0xff))
#define OFFSET(base, ptr, member) (base + ((const char*)(&member) - (const char*)ptr)) 
#define SIZE(x) sizeof(x)




#define MAX_PAYLOAD_SIZE          500
#define PART_NUMBER_SIZE          16
#define DATE_SIZE                 6
#define HARD_RESERVED_SIZE1       3
#define HARD_RESERVED_SIZE2       2
#define JOBCARD_SIZE              12
#define SERIAL_NUMBER_SIZE        4
#define REPAIR_COUNT_SIZE         2
#define HARDWARE_REVISION_SIZE    6
#define OCP_SIZE                  20
#define SOFTWARE_REVISION_SIZE    8
#define USER_SIZE                 32
#define YEAR_SIZE                 2




enum LOADER_MESSAGE_IDS
{
  CMD_NONE,
  CMD_GET_HARDWARE_LABEL,
  RSP_HARDWARE_LABEL,
  CMD_GET_SOFTWARE_LABEL,
  RSP_SOFTWARE_LABEL,
  CMD_READ_MEMORY,
  RSP_READ_MEMORY,
  CMD_GET_TRANSFER_INFO,
  RSP_TRANSFER_INFO,
  CMD_ERASE_FLASH            = 0x30,
  CMD_PROGRAM_FLASH,
  CMD_BLANK_CHECK,
  CMD_SET_HARDWARE_LABEL     = 0x60,
  CMD_START_SESSION,
  CMD_VERIFY_CODE,
  CMD_POLL,
  RSP_FLASH_ACKNOWLEDGE      = 0xf0,
  RSP_ACKNOWLEDGE
};


enum ERROR_CODES
{
  E_OK,                   /* None - command OK/successful                                      */
  E_INVALID_COMMAND,      /* Invalid command                                                   */
  E_INVALID_LENGTH,       /* he message is the incorrect length                                */
  E_CRC,                  /* Invalid CRC or checksum verification                              */
  E_INVALID_PARAMETER,    /* Message content error                                             */
  E_NO_SUPPORT,           /* This version or application does not support the command          */
  E_WRONG_MODE,           /* The remote device is in a mode that does not support this message */
  E_HARDWARE_LABEL,       /* Hardware label is missing                                         */
  E_WRITE_PROTECT,        /* Protection failure                                                */
  E_PROGRAM_FAULT,        /* Flash programming operation failed                                */
  E_ERASE_ERROR,          /* Flash Erase operation failed                                      */
  E_BLANK_CHECK_FAULT,    /* Flash blank check failed                                          */
  E_FLASH_OVERLAY,        /* Could not overlay the data in flash                               */
  E_VERIFY_ERROR,         /* Data does not match                                               */
  E_FLASH_FAILURE,        /* Flash failed                                                      */
};


enum PROCESSORS
{
  PROCESSOR_1,
  PROCESSOR_2,
  PROCESSOR_3,
  PROCESSOR_MAX
};/*PROCESSORS*/

enum FLASH_DEVICES
{
  FLASH_DEVICE_OCP,
  FLASH_DEVICE_LOADER,
  FLASH_DEVICE_USER,
  FLASH_DEVICE_MAX
};/*FLASH_DEVICES*/

enum FLASH_SPACES
{
  FLASH_NONE,
  FLASH_OCP,
  FLASH_LOADER,
  FLASH_USER,
  FLASH_MAX
};/*FLASH_SPACES*/

enum EEPROM_SPACES
{
  EEPROM_MAIN,
  EEPROM_SECONDARY1,
  EEPROM_SECONDARY2,
  EEPROM_SECONDARY3,
  EEPROM_SECONDARY4,
  EEPROM_SECONDARY5,
  EEPROM_MAX
};/*EEPROM_SPACES*/


enum HW_LABEL_NODES
{
  HWL_DAC2_MAIN,
  HWL_DAC2_SECONDARY,
  HWL_DAC2_PSU,
  HWL_DAC2_DISPLAY,
  HWL_DAC2_MOTHER,
  HWL_FEC_MAIN,
  HWL_FEC_ANALYSIS,
  HWL_ETF_MAIN,
  HWL_MAX
};/*HW_LABEL_NODES*/



struct BCDDate                                                              /* Date method used in the software label        */
{
  unsigned char   nDay;                                                     /* Day of the month in BCD e.g. 0x19 = 19th      */
  unsigned char   nMonth;                                                   /* Month of the year in BCD e.g. 0x12 = December */
  unsigned char   nYear[YEAR_SIZE];                                         /* Year in BCD e.g. {0x20, 0x04} = 2004          */
};



struct HardwareLabel                                               /* Avitronics hardware label as per document EJ42122b05   */
{
  char         PartNumber[PART_NUMBER_SIZE];                       /* 1 - 16   The part number of the card in ASCII          */
  char         SerialNumber[SERIAL_NUMBER_SIZE];                   /* 17 - 20  The serial number of the card in ASCII        */
  char         ManufactureDate[DATE_SIZE];                         /* 21 - 26  The manufacturing date in ASCII format YYYYMM */
  char         HardwareRevision[HARDWARE_REVISION_SIZE];           /* 27 - 32  The hardware revision in the form V01.00      */
  char         HardwareModStatus[1];                               /* 33 - 33  The hardware modification status - single character */
  char         cReserved1[HARD_RESERVED_SIZE1];                    /* 34 - 36  Not used - padded with spaces                 */
  char         JobCardNumber[JOBCARD_SIZE];                        /* 37 - 48  The job card number in ASCII                  */
  char         cLastRepairedDate[DATE_SIZE];                       /* 49 - 54  The last repaired date in ASCII format YYYYMM */
  char         cSequentialRepairCount[REPAIR_COUNT_SIZE];          /* 55 - 56  The number of the repair in ASCII             */
  char         cWarrantyExpiryDate[DATE_SIZE];                     /* 57 - 62  The warranty end date in ASCII format YYYYMM  */
  char         cReserved2[HARD_RESERVED_SIZE2];                    /* 63 - 64  Not used - padded with spaces                 */
};

struct EEPROMStructure                                                      /* Layout of the 128 byte EEPROM found on each card                             */
{
  HardwareLabel  stHardwareLabel;                                           /* 1 - 64   Avitronics hardware label as per document EJ42122b05                */
  unsigned long          nLabelBaseAddress;                                 /* 65 - 68  Software label base address 0 = 0x100 below flash top               */
  unsigned long          nFlashMaxSize[PROCESSOR_MAX][FLASH_DEVICE_MAX];    /* 69 - 116 Maximum flash size for each of the flash devices for each processor */
  unsigned char           OCPUserArea[OCP_SIZE];                            /* 117 - 128  The balance of the EEPROM can be utilised by the user             */
};


struct SoftwareLabel                                                        /* Avitronics software label as per document EJ42122b05   */
{
  char    srPartNumber[PART_NUMBER_SIZE];                                   /* The part number of the software in ASCII  e.g. PartNumber MARU = '480307YY22002   ' */
  char    srVersionLabel[SOFTWARE_REVISION_SIZE];                           /* The software version in the form SV 01.00                                           */
  BCDDate stReleaseDate;                                                    /* Release date in packed BCD                                                          */
  BCDDate stCompileDate;                                                    /* Compile date in packed BCD                                                          */
